In [1]:
import pandas as pd

In [5]:
# Create a dictionary to analyse
names_data = {
    "Name" : ["Raj","Roy","Sky","Jay"],
    "Age"  : [20,21,22,23],
    "Language" : ["Py","C","JS","R"]
}

In [6]:
names_data

{'Name': ['Raj', 'Roy', 'Sky', 'Jay'],
 'Age': [20, 21, 22, 23],
 'Language': ['Py', 'C', 'JS', 'R']}

In [12]:
dataFrame = pd.DataFrame(names_data)   # Convert to dataset 
dataFrame

  Name  Age Language
0  Raj   20       Py
1  Roy   21        C
2  Sky   22       JS
3  Jay   23        R

In [11]:
dataFrame.to_csv("my_data")   # indexed data

In [13]:
dataFrame = pd.DataFrame(names_data)   # Convert to dataset 
dataFrame

  Name  Age Language
0  Raj   20       Py
1  Roy   21        C
2  Sky   22       JS
3  Jay   23        R

In [14]:
dataFrame.to_csv("my_data_nocsv",index=False)  # no index

In [15]:
dataFrame = pd.DataFrame(names_data)   # Convert to dataset 
dataFrame

  Name  Age Language
0  Raj   20       Py
1  Roy   21        C
2  Sky   22       JS
3  Jay   23        R

In [19]:
dataFrame.head(2)   # First elements view

  Name  Age Language
0  Raj   20       Py
1  Roy   21        C

In [20]:
dataFrame.tail(2)  # Last elements view

  Name  Age Language
2  Sky   22       JS
3  Jay   23        R

In [21]:
dataFrame.describe()   # if table has integer value columns returns statistical information

             Age
count   4.000000
mean   21.500000
std     1.290994
min    20.000000
25%    20.750000
50%    21.500000
75%    22.250000
max    23.000000